package Laba4;

public class Task1 {

    public static void intMethod () {

        for (int n = 1; 100 > n; n = n + 2) {System.out.println(n);}
    }
    public static void main(String[] args) {

        intMethod ();

    }
}

//Напишите программу, которая выводит на консоль нечетные числа от 1 до 99. Каждое число печатается с новой строки.
